In [1]:
import numpy as np
import pandas as pd

In [2]:
np.random.randn

In [4]:
data= np.random.randn(4,5)

In [5]:
data

array([[-0.36759814, -1.83492909, -1.14228192,  0.85773926,  1.33736343],
       [ 0.75932673, -0.92502326, -1.18368531,  1.53103228, -0.41415083],
       [-1.00295579,  0.40276149, -0.07257092, -0.17596035,  0.56299287],
       [ 0.10174807, -0.64805422, -1.16664654, -1.39282377, -0.44586241]])

In [7]:
dataFrame= pd.DataFrame(data)

In [8]:
dataFrame

          0         1         2         3         4
0 -0.367598 -1.834929 -1.142282  0.857739  1.337363
1  0.759327 -0.925023 -1.183685  1.531032 -0.414151
2 -1.002956  0.402761 -0.072571 -0.175960  0.562993
3  0.101748 -0.648054 -1.166647 -1.392824 -0.445862

In [10]:
type(dataFrame[0])

pandas.core.series.Series

In [11]:
dataFrame[3][2]

-0.175960346861841

In [18]:
yeniDataFrame = pd.DataFrame(data, index=["eray","arif","Ennur","hikmet"],columns=["maas","yas","calisma saati","izin","cinsiyet"]) 
yeniDataFrame

            maas       yas  calisma saati      izin  cinsiyet
eray   -0.367598 -1.834929      -1.142282  0.857739  1.337363
arif    0.759327 -0.925023      -1.183685  1.531032 -0.414151
Ennur  -1.002956  0.402761      -0.072571 -0.175960  0.562993
hikmet  0.101748 -0.648054      -1.166647 -1.392824 -0.445862

In [20]:
yeniDataFrame["yas"]

eray     -1.834929
arif     -0.925023
Ennur     0.402761
hikmet   -0.648054
Name: yas, dtype: float64

In [21]:
yeniDataFrame["calisma saati"]

eray     -1.142282
arif     -1.183685
Ennur    -0.072571
hikmet   -1.166647
Name: calisma saati, dtype: float64

In [22]:
yeniDataFrame[["yas","maas"]]

             yas      maas
eray   -1.834929 -0.367598
arif   -0.925023  0.759327
Ennur   0.402761 -1.002956
hikmet -0.648054  0.101748

In [23]:
yeniDataFrame.loc["eray"]

maas            -0.367598
yas             -1.834929
calisma saati   -1.142282
izin             0.857739
cinsiyet         1.337363
Name: eray, dtype: float64

In [25]:
yeniDataFrame.loc["Ennur"]

maas            -1.002956
yas              0.402761
calisma saati   -0.072571
izin            -0.175960
cinsiyet         0.562993
Name: Ennur, dtype: float64

In [26]:
yeniDataFrame.iloc[1]

maas             0.759327
yas             -0.925023
calisma saati   -1.183685
izin             1.531032
cinsiyet        -0.414151
Name: arif, dtype: float64

In [27]:
yeniDataFrame

            maas       yas  calisma saati      izin  cinsiyet
eray   -0.367598 -1.834929      -1.142282  0.857739  1.337363
arif    0.759327 -0.925023      -1.183685  1.531032 -0.414151
Ennur  -1.002956  0.402761      -0.072571 -0.175960  0.562993
hikmet  0.101748 -0.648054      -1.166647 -1.392824 -0.445862

In [28]:
yeniDataFrame["emeklilik yasi"] = yeniDataFrame["yas"] + yeniDataFrame["yas"]
yeniDataFrame

            maas       yas  calisma saati      izin  cinsiyet  emeklilik yasi
eray   -0.367598 -1.834929      -1.142282  0.857739  1.337363       -3.669858
arif    0.759327 -0.925023      -1.183685  1.531032 -0.414151       -1.850047
Ennur  -1.002956  0.402761      -0.072571 -0.175960  0.562993        0.805523
hikmet  0.101748 -0.648054      -1.166647 -1.392824 -0.445862       -1.296108

In [33]:
yeniDataFrame.drop("emeklilik yasi", axis=1)

            maas       yas  calisma saati      izin  cinsiyet
eray   -0.367598 -1.834929      -1.142282  0.857739  1.337363
arif    0.759327 -0.925023      -1.183685  1.531032 -0.414151
Ennur  -1.002956  0.402761      -0.072571 -0.175960  0.562993
hikmet  0.101748 -0.648054      -1.166647 -1.392824 -0.445862

In [35]:
yeniDataFrame.drop("eray", axis=0)

            maas       yas  calisma saati      izin  cinsiyet  emeklilik yasi
arif    0.759327 -0.925023      -1.183685  1.531032 -0.414151       -1.850047
Ennur  -1.002956  0.402761      -0.072571 -0.175960  0.562993        0.805523
hikmet  0.101748 -0.648054      -1.166647 -1.392824 -0.445862       -1.296108

In [43]:
yeniDataFrame

            maas       yas  calisma saati      izin  cinsiyet
eray   -0.367598 -1.834929      -1.142282  0.857739  1.337363
arif    0.759327 -0.925023      -1.183685  1.531032 -0.414151
Ennur  -1.002956  0.402761      -0.072571 -0.175960  0.562993
hikmet  0.101748 -0.648054      -1.166647 -1.392824 -0.445862

In [46]:
yeniDataFrame.drop("cinsiyet", axis=1, inplace=True)

In [47]:
yeniDataFrame

            maas       yas  calisma saati      izin
eray   -0.367598 -1.834929      -1.142282  0.857739
arif    0.759327 -0.925023      -1.183685  1.531032
Ennur  -1.002956  0.402761      -0.072571 -0.175960
hikmet  0.101748 -0.648054      -1.166647 -1.392824

In [48]:
yeniDataFrame.loc["eray"]

maas            -0.367598
yas             -1.834929
calisma saati   -1.142282
izin             0.857739
Name: eray, dtype: float64

In [49]:
yeniDataFrame.loc["eray"]["yas"]

-1.8349290935078855

In [50]:
yeniDataFrame

            maas       yas  calisma saati      izin
eray   -0.367598 -1.834929      -1.142282  0.857739
arif    0.759327 -0.925023      -1.183685  1.531032
Ennur  -1.002956  0.402761      -0.072571 -0.175960
hikmet  0.101748 -0.648054      -1.166647 -1.392824

In [53]:
booleanFrame=yeniDataFrame < 0

In [54]:
booleanFrame

         maas    yas  calisma saati   izin
eray     True   True           True  False
arif    False   True           True  False
Ennur    True  False           True   True
hikmet  False   True           True   True

In [55]:
yeniDataFrame[booleanFrame]

            maas       yas  calisma saati      izin
eray   -0.367598 -1.834929      -1.142282       NaN
arif         NaN -0.925023      -1.183685       NaN
Ennur  -1.002956       NaN      -0.072571 -0.175960
hikmet       NaN -0.648054      -1.166647 -1.392824

In [56]:
yeniDataFrame

            maas       yas  calisma saati      izin
eray   -0.367598 -1.834929      -1.142282  0.857739
arif    0.759327 -0.925023      -1.183685  1.531032
Ennur  -1.002956  0.402761      -0.072571 -0.175960
hikmet  0.101748 -0.648054      -1.166647 -1.392824

In [57]:
yeniDataFrame.reset_index()

    index      maas       yas  calisma saati      izin
0    eray -0.367598 -1.834929      -1.142282  0.857739
1    arif  0.759327 -0.925023      -1.183685  1.531032
2   Ennur -1.002956  0.402761      -0.072571 -0.175960
3  hikmet  0.101748 -0.648054      -1.166647 -1.392824

In [58]:
yeniIndexListesi = ["Er","En","Ar","Meh"]

In [60]:
yeniDataFrame["yeni Index"] = yeniIndexListesi
yeniDataFrame

            maas       yas  calisma saati      izin yeni Index
eray   -0.367598 -1.834929      -1.142282  0.857739         Er
arif    0.759327 -0.925023      -1.183685  1.531032         En
Ennur  -1.002956  0.402761      -0.072571 -0.175960         Ar
hikmet  0.101748 -0.648054      -1.166647 -1.392824        Meh

In [61]:
yeniDataFrame.set_index("yeni Index")

                maas       yas  calisma saati      izin
yeni Index
Er         -0.367598 -1.834929      -1.142282  0.857739
En          0.759327 -0.925023      -1.183685  1.531032
Ar         -1.002956  0.402761      -0.072571 -0.175960
Meh         0.101748 -0.648054      -1.166647 -1.392824

In [62]:
yeniDataFrame.set_index("yeni Index", inplace=True)

In [63]:
yeniDataFrame

                maas       yas  calisma saati      izin
yeni Index
Er         -0.367598 -1.834929      -1.142282  0.857739
En          0.759327 -0.925023      -1.183685  1.531032
Ar         -1.002956  0.402761      -0.072571 -0.175960
Meh         0.101748 -0.648054      -1.166647 -1.392824

In [65]:
yeniDataFrame.loc["Er"]

maas            -0.367598
yas             -1.834929
calisma saati   -1.142282
izin             0.857739
Name: Er, dtype: float64

In [66]:
ilkIndexler = ["Simpson","Simpson","Simpson",
              "South Park", "South Park", "South Park"]

In [67]:
icIndexler = ["Homer","Bart"," Marge","Cartman","Kenny","Kyle"]

In [69]:
birlesmisIndex = list(zip(ilkIndexler, icIndexler))
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', ' Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [71]:
birlesmisIndex = pd.MultiIndex.from_tuples(birlesmiIndex)

In [72]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',  ' Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [73]:
benimCizgiFilmListem = [[40,"A"],[30,"B"],[20,"C"],[40,"D"],[50,"E"],[60,"F"]]
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [76]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi, index=birlesmisIndex,
                                 columns=["Yas","Meslek"])

In [77]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     30      B
            Marge   20      C
South Park Cartman  40      D
           Kenny    50      E
           Kyle     60      F

In [78]:
cizgiFilmDataFrame.loc["Simpson"]

       Yas Meslek
Homer   40      A
Bart    30      B
 Marge  20      C

In [79]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

Yas       50
Meslek     E
Name: Kenny, dtype: object

In [80]:
cizgiFilmDataFrame.index.names = ["Film Ad","sim"]

In [81]:
cizgiFilmDataFrame

                   Yas Meslek
Film Ad   sim
Simpson    Homer    40      A
           Bart     30      B
            Marge   20      C
South Park Cartman  40      D
           Kenny    50      E
           Kyle     60      F